Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA91_DFP/1.0.11/include/pic32cz2051ca91176.h
/* ************************************************************************** */
/*   BASE ADDRESS DEFINITIONS FOR PIC32CZ2051CA91176                          */
/* ************************************************************************** */
#define AC_BASE_ADDRESS                  _UINT32_(0x46822000)                          /* AC Base Address */
#define ADC_BASE_ADDRESS                 _UINT32_(0x46820000)                          /* ADC Base Address */
#define CAN0_BASE_ADDRESS                _UINT32_(0x45060000)                          /* CAN0 Base Address */
#define CAN1_BASE_ADDRESS                _UINT32_(0x46060000)                          /* CAN1 Base Address */
#define CAN2_BASE_ADDRESS                _UINT32_(0x46062000)                          /* CAN2 Base Address */
#define CAN3_BASE_ADDRESS                _UINT32_(0x45860000)                          /* CAN3 Base Address */
#define CAN4_BASE_ADDRESS                _UINT32_(0x45062000)                          /* CAN4 Base Address */
#define CAN5_BASE_ADDRESS                _UINT32_(0x46860000)                          /* CAN5 Base Address */
#define DMA_BASE_ADDRESS                 _UINT32_(0x44850000)                          /* DMA Base Address */
#define DRMTCM_BASE_ADDRESS              _UINT32_(0x44820000)                          /* DRMTCM Base Address */
#define DSU_BASE_ADDRESS                 _UINT32_(0x44000000)                          /* DSU Base Address */
#define EBI_BASE_ADDRESS                 _UINT32_(0x458b0000)                          /* EBI Base Address */
#define EIC_BASE_ADDRESS                 _UINT32_(0x44800000)                          /* EIC Base Address */
#define ETH_BASE_ADDRESS                 _UINT32_(0x45070000)                          /* ETH Base Address */
#define EVSYS_BASE_ADDRESS               _UINT32_(0x44860000)                          /* EVSYS Base Address */
#define FCR_BASE_ADDRESS                 _UINT32_(0x44004000)                          /* FCR Base Address */
#define FCW_BASE_ADDRESS                 _UINT32_(0x44002000)                          /* FCW Base Address */
#define FREQM_BASE_ADDRESS               _UINT32_(0x44060000)                          /* FREQM Base Address */
#define FUSES_BOOTCFG1_BASE_ADDRESS      _UINT32_(0x0a002000)                          /* FUSES Base Address */
#define FUSES_BOOTCFG2_BASE_ADDRESS      _UINT32_(0x0a00a000)                          /* FUSES Base Address */
#define FUSES_CALOTP_BASE_ADDRESS        _UINT32_(0x0a007000)                          /* FUSES Base Address */
#define FUSES_DALCFG_BASE_ADDRESS        _UINT32_(0x0a004000)                          /* FUSES Base Address */
#define FUSES_USERCFG1_BASE_ADDRESS      _UINT32_(0x0a000000)                          /* FUSES Base Address */
#define FUSES_USERCFG2_BASE_ADDRESS      _UINT32_(0x0a008000)                          /* FUSES Base Address */
#define GCLK_BASE_ADDRESS                _UINT32_(0x44050000)                          /* GCLK Base Address */
#define HSM_BASE_ADDRESS                 _UINT32_(0x4f018000)                          /* HSM Base Address */
#define MCLK_BASE_ADDRESS                _UINT32_(0x44052000)                          /* MCLK Base Address */
#define MCRAMC_BASE_ADDRESS              _UINT32_(0x44822000)                          /* MCRAMC Base Address */
#define MLB_BASE_ADDRESS                 _UINT32_(0x458c0000)                          /* MLB Base Address */
#define OSC32KCTRL_BASE_ADDRESS          _UINT32_(0x44042000)                          /* OSC32KCTRL Base Address */
#define OSCCTRL_BASE_ADDRESS             _UINT32_(0x44040000)                          /* OSCCTRL Base Address */
#define PAC_BASE_ADDRESS                 _UINT32_(0x44810000)                          /* PAC Base Address */
#define PM_BASE_ADDRESS                  _UINT32_(0x44010000)                          /* PM Base Address */
#define PORT_AHB_BASE_ADDRESS            _UINT32_(0x40000000)                          /* PORT Base Address */
#define PORT_BASE_ADDRESS                _UINT32_(0x44840000)                          /* PORT Base Address */
#define PRM_BASE_ADDRESS                 _UINT32_(0x44080000)                          /* PRM Base Address */
#define PTC_BASE_ADDRESS                 _UINT32_(0x46828000)                          /* PTC Base Address */
#define RSTC_BASE_ADDRESS                _UINT32_(0x44030000)                          /* RSTC Base Address */
#define RTC_BASE_ADDRESS                 _UINT32_(0x44072000)                          /* RTC Base Address */
#define SDMMC0_BASE_ADDRESS              _UINT32_(0x458a0000)                          /* SDMMC0 Base Address */
#define SDMMC1_BASE_ADDRESS              _UINT32_(0x460a0000)                          /* SDMMC1 Base Address */
#define SERCOM0_BASE_ADDRESS             _UINT32_(0x46000000)                          /* SERCOM0 Base Address */
#define SERCOM1_BASE_ADDRESS             _UINT32_(0x46002000)                          /* SERCOM1 Base Address */
#define SERCOM2_BASE_ADDRESS             _UINT32_(0x45800000)                          /* SERCOM2 Base Address */
#define SERCOM3_BASE_ADDRESS             _UINT32_(0x45802000)                          /* SERCOM3 Base Address */
#define SERCOM4_BASE_ADDRESS             _UINT32_(0x46004000)                          /* SERCOM4 Base Address */
#define SERCOM5_BASE_ADDRESS             _UINT32_(0x45804000)                          /* SERCOM5 Base Address */
#define SERCOM6_BASE_ADDRESS             _UINT32_(0x45806000)                          /* SERCOM6 Base Address */
#define SERCOM7_BASE_ADDRESS             _UINT32_(0x45000000)                          /* SERCOM7 Base Address */
#define SPI_IXS0_BASE_ADDRESS            _UINT32_(0x46030000)                          /* SPI_IXS0 Base Address */
#define SPI_IXS1_BASE_ADDRESS            _UINT32_(0x45030000)                          /* SPI_IXS1 Base Address */
#define SQI0_BASE_ADDRESS                _UINT32_(0x4f008000)                          /* SQI0 Base Address */
#define SQI1_BASE_ADDRESS                _UINT32_(0x4f009000)                          /* SQI1 Base Address */
#define SUPC_BASE_ADDRESS                _UINT32_(0x44020000)                          /* SUPC Base Address */
#define TCC0_BASE_ADDRESS                _UINT32_(0x45010000)                          /* TCC0 Base Address */
#define TCC1_BASE_ADDRESS                _UINT32_(0x45012000)                          /* TCC1 Base Address */
#define TCC2_BASE_ADDRESS                _UINT32_(0x45014000)                          /* TCC2 Base Address */
#define TCC3_BASE_ADDRESS                _UINT32_(0x45810000)                          /* TCC3 Base Address */
#define TCC4_BASE_ADDRESS                _UINT32_(0x45812000)                          /* TCC4 Base Address */
#define TCC5_BASE_ADDRESS                _UINT32_(0x46010000)                          /* TCC5 Base Address */
#define TCC6_BASE_ADDRESS                _UINT32_(0x46012000)                          /* TCC6 Base Address */
#define TCC7_BASE_ADDRESS                _UINT32_(0x46810000)                          /* TCC7 Base Address */
#define TCC8_BASE_ADDRESS                _UINT32_(0x46812000)                          /* TCC8 Base Address */
#define TCC9_BASE_ADDRESS                _UINT32_(0x46814000)                          /* TCC9 Base Address */
#define TRAM_BASE_ADDRESS                _UINT32_(0x44824000)                          /* TRAM Base Address */
#define TRNG_BASE_ADDRESS                _UINT32_(0x44870000)                          /* TRNG Base Address */
#define USBHS0_BASE_ADDRESS              _UINT32_(0x4f010000)                          /* USBHS0 Base Address */
#define USBHS1_BASE_ADDRESS              _UINT32_(0x4f012000)                          /* USBHS1 Base Address */
#define WDT_BASE_ADDRESS                 _UINT32_(0x44070000)                          /* WDT Base Address */

/* ************************************************************************** */
/*   PIO DEFINITIONS FOR PIC32CZ2051CA91176                                   */
/* ************************************************************************** */
#include "pio/pic32cz2051ca91176.h"

/* ************************************************************************** */
/*   MEMORY MAPPING DEFINITIONS FOR PIC32CZ2051CA91176                        */
/* ************************************************************************** */
#define ITCM_SIZE                      _UINT32_(0x00020000)    /*  128kB Memory segment type: ram */
#define PRM_ROM_SIZE                   _UINT32_(0x00008000)    /*   32kB Memory segment type: rom */
#define FCR_BFM_SIZE                   _UINT32_(0x00020000)    /*  128kB Memory segment type: flash */
#define FCR_BFM_PAGE_SIZE              _UINT32_(      4096)
#define FCR_BFM_NB_OF_PAGES            _UINT32_(        32)

#define FCR_CFM_USERCFG1_SIZE          _UINT32_(0x00001000)    /*    4kB Memory segment type: flash */
#define FCR_CFM_USERCFG1_PAGE_SIZE     _UINT32_(      4096)
#define FCR_CFM_USERCFG1_NB_OF_PAGES   _UINT32_(         1)

#define FCR_CFM_USEROTP1_SIZE          _UINT32_(0x00001000)    /*    4kB Memory segment type: user_signatures */
#define FCR_CFM_USEROTP1_PAGE_SIZE     _UINT32_(      4096)
#define FCR_CFM_USEROTP1_NB_OF_PAGES   _UINT32_(         1)

#define FCR_CFM_BOOTCFG1_SIZE          _UINT32_(0x00001000)    /*    4kB Memory segment type: flash */
#define FCR_CFM_BOOTCFG1_PAGE_SIZE     _UINT32_(      4096)
#define FCR_CFM_BOOTCFG1_NB_OF_PAGES   _UINT32_(         1)

